#include <iostream>
using namespace std;
int floored(int top, int bottom) {
  int acc = top % bottom;
  top -= acc;
  return top / bottom;
}
int main() {
  int l, s, step = 0;
  cin >> l >> s;
  int co = s;
  if (s == 0 || s > l * 9) {
    cout << "-1 -1" << endl;
    return 0;
  }
  else {
    string mx, mn;
    for (int i = 0; i < l; i++) {
      while (s >= 9) {
        mx += "9";
        s -= 9;
        step++;
      }
      mx[step - 1] = 1;
    }
  }
}

// TODO: complete the problem...
// سلام صبح بخیر برای این سوال، اول چک میکنیم که این کار شدنیه یا نه، که کافیه چک کنیم متغیر اس صفر نباشه و از 9 ضربدر تعداد ارقام هم بزرگتر نباشه برای ساختن باقی کار، برای پیدا کردن ماکسیمم، جزء صحیح اس رو بر عدد 9 پیدا می کنیم.اون تعدادی که به دست میاد رو از اول 9 میذاریم، اون مقداری که از جمع باقی مونده رو میذاریم رقم بعدی.اگررقمی خالی مونده بود، با صفر جایگزین میکنیم.برای پیدا کردن مقدار مینیمم، رقم سمت چپ رو یک میذاریم، شروع میکنیم به جایگزین کردن 9 ها از سمت راست، زمانی که به اس رسیدیم، جاهای خالی رو با 0 پر میکنیم